Tekla Open API Reference for Tekla Structures 2025
DrawingObject.GetRelatedObjects Method (Type[])
 Gets the related objects of the current object that are of certain types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetRelatedObjects(
	Type[] typeFilter
)
Public Function GetRelatedObjects (
	typeFilter As Type()
) As DrawingObjectEnumerator
Parameters
typeFilter
Type: System.Type[]
The types of the objects to get.
Return Value
Type: DrawingObjectEnumerator
The related objects of the current object that are of certain types.
Implements
IRelatedObjects.GetRelatedObjects(Type[])
See Also
Reference
DrawingObject Class
GetRelatedObjects Overload
Tekla.Structures.Drawing Namespace